ReikanYsora/Helios-Mini/firmware/sdkconfig.defaults
# Helios Mini V0.1 - Waveshare ESP32-S3-Touch-AMOLED-1.32
#
# Base values mirror Waveshare's own proven ESP-IDF 5.5.1 example for this
# exact board (07_LVGL_V9_Test/sdkconfig.defaults) minus their demo widgets.
# See docs/HARDWARE_REFERENCE.md.

CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

CONFIG_FREERTOS_HZ=1000

# mbedTLS's own SSL buffers (16 KB in + 4 KB out per session) default to
# internal RAM - fine until something needs a TLS session on top of the
# rest of the app (Wi-Fi, HTTP server, LVGL, ha_ws's own websocket, ...):
# helios/irradiance_model's HTTPS GET to Open-Meteo hit
# "mbedtls_ssl_setup returned -0x7F00" (MBEDTLS_ERR_SSL_ALLOC_FAILED) with
# internal RAM down to ~18 KB free at the time. External puts these
# buffers in PSRAM instead (8 MB, barely used) - a standard, IDF-supported
# mode for exactly this situation (see mbedtls/Kconfig), not the same kind
# of PSRAM attempt that broke the LCD panel's DMA-bound queued transmit -
# these are plain CPU/crypto-accelerator-read buffers, not that driver.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# The BSD-socket layer's own cap (default 10) was the real bottleneck
# behind an "MQTT save hangs, device stops answering" incident: the
# settings web server alone reserves up to max_open_sockets=7
# (esp_http_server's own default), leaving only 3 for ha_ws's websocket +
# helios/irradiance_model's periodic HTTPS fetch + helios/mqtt_bridge's
# connection combined - exhausted the moment more than one of those was
# active at once, and a new httpd client connection (e.g. loading /mqtt)
# had nothing left to open with. The underlying TCP layer was already
# provisioned for more (LWIP_MAX_ACTIVE_TCP/LWIP_MAX_LISTENING_TCP default
# to 16) - this just raises the BSD-socket ceiling to match what's already
# budgeted underneath it, not a new unbounded cost.
CONFIG_LWIP_MAX_SOCKETS=16

# LVGL v9 (lvgl/lvgl managed component) configuration via Kconfig.
# All on-screen text uses the Figtree fonts (ui/fonts), so no Montserrat
# sizes are enabled here - LVGL keeps its built-in Montserrat 14 as the
# internal LV_FONT_DEFAULT fallback on its own.
# lv_snapshot_take() - powers /debug's screenshot download (display_take_screenshot_bmp()).
CONFIG_LV_USE_SNAPSHOT=y
# lv_qrcode - onboarding QR codes on screen (ui/qr).
CONFIG_LV_USE_QRCODE=y

# --- Performance (see docs/HARDWARE_REFERENCE.md and the perf audit) ---
# Max out the S3: 240 MHz core and 80 MHz octal PSRAM. The LVGL draw
# buffers live in PSRAM, so its clock is a direct lever on render/flush
# throughput. Both validated on real hardware; back off (160 / 40M) if the
# board shows instability.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_SPIRAM_SPEED_80M=y
# Target 60 fps for the swipe and animations (was 33 ms / ~30 fps).
CONFIG_LV_DEF_REFR_PERIOD=16

# Render the anti-aliased arcs on both cores during the two-tile swipe
# transition (the heaviest render case). Needs LVGL's FreeRTOS OS layer for
# the draw worker threads.
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=2

# Per-core CPU-usage % (via the idle task run-time counters) for the
# diagnostics panel / MQTT. Cheap: one esp_timer read per context switch.
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
